Revit 2025 API
SectionType Enumeration
 Declares the section data type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum SectionType
Public Enumeration SectionType
public enum class SectionType
type SectionType
Members
Member name | Value | Description
Header | 0
Body | 1
Summary | 2
Footer | 3
None | -1
See Also
Reference
Autodesk.Revit.DB Namespace